
&НаСервереБезКонтекста
Функция ВалютаПриИзмененииНаСервере(ПарамВалюта,ПарамДата)
	// Вставить содержимое обработчика.
	
	Запрос = новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	isnull(КурсыВалютСрезПоследних.Курс,0) как Курс
	|ИЗ
	|	РегистрСведений.КурсыВалют.СрезПоследних(&Дата, Валюта = &Валюта) КАК КурсыВалютСрезПоследних";
	Запрос.УстановитьПараметр("Дата",ПарамДата);
	Запрос.УстановитьПараметр("Валюта",ПарамВалюта);
	
	выборка = Запрос.Выполнить().Выбрать();
	ЕСли выборка.Следующий() Тогда
		возврат выборка.Курс;
	Иначе
		возврат 0;
	КонецЕсли;	
	
	
КонецФункции

&НаКлиенте
Процедура ВалютаПриИзменении(Элемент)
	
	Объект.Курс = ВалютаПриИзмененииНаСервере(Объект.Валюта,Объект.Дата);
КонецПроцедуры
